app/views/static_pages/home.html.erb


<% current_user.stories.each do |story| %>
---
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = 3