app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @story = Story.find(params[:id])

SELECT "categories".* FROM "categories"
---
  def new
    @story = Story.new
    @categories = Category.all

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"
---
  def edit
    @story = Story.find(params[:id])
    @categories = Category.all

INSERT INTO "stories" ("category_id", "created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Thu, 03 Jan 2013 17:08:13 UTC +00:00], ["description", "Hellos yall"], ["title", "Hello"], ["updated_at", Thu, 03 Jan 2013 17:08:13 UTC +00:00], ["user_id", 3]]
---
  def create
    @story = Story.new(params[:story])
    @story.user_id = current_user.id
    respond_to do |format|
      if @story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @story = Story.find(params[:id])

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "stories" WHERE "stories"."id" = ?  [["id", 1]]
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy